import React from 'react'
import style from './home.module.css'
import first_pic from '../../Pictures/logo.png'
import second_pic from '../../Pictures/mh_table.jpg'
import third_pic from '../../Pictures/mh_book.jpg'

const Home = () => {
    return(
        <body className={style.home_page}>
            <div className={style.container}>
            <div className={`${style.stories} ${style.fonts}`}>
                <span className={`${style.story}`}>Михайло Грушевський — видатний український історик, громадський діяч і перший голова Центральної Ради УНР,
                    який відіграв ключову роль у становленні української державності початку ХХ століття. Народився 1866 року в місті Холм (сучасна Польща),
                    але зростав у сім'ї, де з дитинства вивчав українську історію та культуру. Він здобув освіту в Київському університеті, а згодом став професором
                    у Львові, де почав писати свою масштабну «Історію України-Руси» — роботу, що охопила всі етапи історії українських земель.</span>
                <img src={first_pic} alt="Mykhailo Hryshevsky" />
            </div>
            </div>
            <div className={style.container}>
            <div class={`${style.second_story}`}>
                <div className={`${style.stories} ${style.fonts}`}>
                <img src={second_pic} alt="Mykhailo Hryshevsky" />
                <span className={`${style.story}`}>Він був не тільки істориком і політиком, але й плідним письменником.
                    Його найвідоміша праця — «Історія України-Руси» — монументальна багатотомна робота, яка охоплює всю історію українських земель
                    від найдавніших часів до XVII століття. Ця праця стала фундаментом для української історіографії, оскільки Грушевський був одним з перших,
                    хто розглядав історію України як окрему від історії Росії та Польщі. Це не лише історична праця, але й важливий елемент формування української ідентичності,
                    особливо цінний і актуальний сьогодні.</span>
                </div>
            </div>
            
            </div>
            <div className={style.container}>
            <div className={`${style.stories} ${style.fonts}`}>
                <span className={`${style.story}`}>Михайло Грушевський залишив помітний слід у багатьох сферах суспільного та культурного життя України.
                    Як історик, він здійснив глибокий аналіз української минувшини, заклавши наукову базу для подальших поколінь дослідників.
                    Його погляди на історію України як на самостійну, відмінну від сусідніх держав історичну реальність, відобразилися в десятках наукових і
                    публіцистичних праць, які він писав до кінця свого життя.</span>
                    <img src={third_pic} alt="Mykhailo Hryshevsky" />
            </div>
            </div>
        </body>
    )
}

export default Home;